1password
a52dec
abseil-cpp
accountsservice
acl
adwaita-cursors
adwaita-fonts
adwaita-icon-theme
adwaita-icon-theme-legacy
alsa-card-profiles
alsa-firmware
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
amd-ucode
aom
appstream
aquamarine
archlinux-keyring
aspell
atkmm
at-spi2-core
attica
attr
audit
autoconf
automake
avahi
ayatana-ido
b43-fwcutter
baloo
baloo-widgets
base
base-devel
bash
bash-completion
bind
binutils
bison
blas
blueman
bluez
bluez-libs
bluez-utils
breeze-icons
brotli
btrfs-progs
bubblewrap
bzip2
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cairomm-1.16
cantarell-fonts
c-ares
cblas
chromaprint
cifs-utils
cliphist
code
convertlit
coreutils
cpio
cpupower
cryptsetup
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-units
dconf
debugedit
default-cursors
desktop-file-utils
device-mapper
diffutils
ding-libs
discord
dmidecode
dmraid
dnsmasq
dnssec-anchors
dolphin
dosfstools
double-conversion
downgrade
dracut
duf
duktape
e2fsprogs
ebook-tools
efibootmgr
efitools
efivar
eglexternalplatform
egl-gbm
egl-wayland
egl-wayland2
egl-x11
electron39
ell
enchant
endeavouros-branding
endeavouros-keyring
endeavouros-mirrorlist
eos-apps-info
eos-bash-shared
eos-dracut
eos-hooks
eos-log-tool
eos-packagelist
eos-qogir-icons
eos-quickstart
eos-rankmirrors
eos-reboot-recommended
eos-translations
eos-update
ethtool
exfatprogs
exiv2
exo
expac
expat
f2fs-tools
faac
faad2
fakeroot
fcft
fd
ffmpeg
ffmpegthumbnailer
fftw
file
file-roller
filesystem
findutils
firefox
firewalld
flac
flex
fluidsynth
fmt
fontconfig
foot
freetype2
fribidi
fuse2
fuse3
fuse-common
fzf
gamemode
gamescope
gawk
gc
gcc
gcc-libs
gcr
gcr-4
gdbm
gdk-pixbuf2
gettext
giflib
git
glances
glfw
glib2
glibc
glibmm
glibmm-2.68
glib-networking
glslang
glycin
gmp
gnulib-l10n
gnupg
gnutls
gobject-introspection-runtime
google-chrome
gperftools
gpgme
gpgmepp
gpm
gpsd
graphene
graphite
grep
grim
groff
grub
gsettings-desktop-schemas
gsettings-system-schemas
gsm
gspell
gssdp
gssproxy
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base-libs
gst-plugins-ugly
gstreamer
gtest
gtk3
gtk4
gtk-layer-shell
gtkmm3
gtkmm-4.0
gtksourceview3
gtksourceview4
gtk-update-icon-cache
guile
gupnp
gupnp-igd
gzip
harfbuzz
harfbuzz-icu
haveged
hdparm
hicolor-icon-theme
hidapi
highway
htop
hwdata
hwdetect
hwinfo
hyphen
hyprcursor
hyprgraphics
hyprland
hyprland-guiutils
hyprlang
hyprpaper
hyprtoolkit
hyprutils
hyprwayland-scanner
hyprwire
iana-etc
icu
imagemagick
imath
inetutils
iniparser
inxi
iotop
iproute2
iptables-nft
iputils
iso-codes
iwd
jansson
jbigkit
jemalloc
jfsutils
json-c
jsoncpp
json-glib
karchive
kbd
kbookmarks
kcmutils
kcodecs
kcolorscheme
kcompletion
kconfig
kconfigwidgets
kcoreaddons
kcrash
kdbusaddons
kdnssd
kdsoap-qt6
kdsoap-ws-discovery-client
keyutils
kfilemetadata
kglobalaccel
kguiaddons
ki18n
kiconthemes
kidletime
kio
kio-extras
kirigami
kitemviews
kjobwidgets
kmod
knewstuff
knotifications
kpackage
kparts
krb5
kservice
ktextwidgets
kuserfeedback
kwallet
kwidgetsaddons
kwindowsystem
kxmlgui
lame
lapack
lcms2
ldb
leancrypto
less
lib32-alsa-lib
lib32-alsa-plugins
lib32-audit
lib32-brotli
lib32-bzip2
lib32-curl
lib32-dbus
lib32-e2fsprogs
lib32-expat
lib32-fontconfig
lib32-freetype2
lib32-gcc-libs
lib32-glib2
lib32-glibc
lib32-gmp
lib32-gnutls
lib32-icu
lib32-json-c
lib32-keyutils
lib32-krb5
lib32-libcap
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libgcrypt
lib32-libglvnd
lib32-libgpg-error
lib32-libidn2
lib32-libldap
lib32-libnghttp2
lib32-libnghttp3
lib32-libngtcp2
lib32-libnm
lib32-libnsl
lib32-libpciaccess
lib32-libpipewire
lib32-libpng
lib32-libpsl
lib32-libssh2
lib32-libtasn1
lib32-libtirpc
lib32-libunistring
lib32-libva
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxcrypt-compat
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxinerama
lib32-libxml2
lib32-libxshmfence
lib32-libxss
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-ncurses
lib32-nettle
lib32-nspr
lib32-nss
lib32-nvidia-utils
lib32-openssl
lib32-p11-kit
lib32-pam
lib32-pcre2
lib32-pipewire
lib32-spirv-tools
lib32-sqlite
lib32-systemd
lib32-util-linux
lib32-vulkan-icd-loader
lib32-wayland
lib32-xz
lib32-zlib
lib32-zstd
libadwaita
libaio
libappindicator
libarchive
libass
libassuan
libasyncns
libatasmart
libavc1394
libavif
libavtp
libayatana-appindicator
libayatana-indicator
libb2
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-smart
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcanberra
libcap
libcap-ng
libcdio
libcloudproviders
libcolord
libcups
libcurl-gnutls
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdc1394
libdca
libde265
libdecor
libdeflate
libdisplay-info
libdovi
libdrm
libdv
libdvdcss
libdvdnav
libdvdread
libebur128
libedit
libei
libelf
libepoxy
libevdev
libevent
libexif
libfdk-aac
libffi
libfontenc
libfreeaptx
libfyaml
libgcrypt
libgirepository
libglvnd
libgme
libgpg-error
libgsf
libgtop
libgudev
libice
libidn2
libiec61883
libimagequant
libimobiledevice
libimobiledevice-glue
libinih
libinput
libisl
libjpeg-turbo
libjxl
libkexiv2
libksba
liblc3
libldac
libldap
libliftoff
liblqr
liblrdf
libltc
libmakepkg-dropins
libmanette
libmaxminddb
libmbim
libmd
libmicrodns
libmm-glib
libmnl
libmodplug
libmpc
libmpcdec
libmpdclient
libmpeg2
libmtp
libmysofa
libnautilus-extension
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnma
libnma-common
libnma-gtk4
libnotify
libnsl
libnvme
libogg
libopenmpt
libopenraw
libp11-kit
libpcap
libpciaccess
libpgm
libpipeline
libpipewire
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libqmi
libqrtr-glib
libraqm
libraw1394
librsvg
libsamplerate
libsasl
libseccomp
libsecret
libsigc++
libsigc++-3.0
libsm
libsndfile
libsodium
libsoup3
libsoxr
libsrtp
libssh
libssh2
libstemmer
libsysprof-capture
libtasn1
libtatsu
libteam
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libunibreak
libunistring
libunwind
liburcu
liburing
libusb
libusbmuxd
libutempter
libutf8proc
libuv
libva
libva-nvidia-driver
libvdpau
libverto
libvorbis
libvpl
libvpx
libwacom
libwbclient
libwebp
libwireplumber
libwnck3
libx11
libx86emu
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcrypt-compat
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfce4ui
libxfce4util
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmlb
libxmu
libxpm
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzip
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-amdgpu
linux-firmware-atheros
linux-firmware-broadcom
linux-firmware-cirrus
linux-firmware-intel
linux-firmware-mediatek
linux-firmware-nvidia
linux-firmware-other
linux-firmware-radeon
linux-firmware-realtek
linux-firmware-whence
linux-headers
llvm-libs
lmdb
lm_sensors
logrotate
lsb-release
l-smash
lsof
lsscsi
lua
luajit
luit
lv2
lvm2
lz4
lzo
m4
mailcap
make
mako
man-db
mangohud
man-pages
md4c
mdadm
media-player-info
meld
mesa
mesa-utils
minizip
mjpegtools
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
modemmanager
mpdecimal
mpfr
mpg123
mtdev
mtools
muparser
nano
nano-syntax-highlighting
ncurses
neon
netctl
nettle
networkmanager
network-manager-applet
networkmanager-openconnect
networkmanager-openvpn
networkmanager-vpn-plugin-openconnect
networkmanager-vpn-plugin-openvpn
nfsidmap
nfs-utils
nftables
nilfs-utils
nm-connection-editor
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
npth
nspr
nss
nss-mdns
ntfs-3g
ntp
nvidia-hook
nvidia-inst
nvidia-open
nvidia-utils
nvtop
oath-toolkit
ocl-icd
openal
openconnect
opencore-amr
openexr
openh264
openjpeg2
openssh
openssl
openvpn
opus
orc
os-prober
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pacutils
pahole
pam
pambase
pango
pangomm
pangomm-2.48
parallel
parted
patch
pavucontrol
pciutils
pcre
pcre2
pcsclite
perl
perl-clone
perl-encode-locale
perl-error
perl-file-listing
perl-html-parser
perl-html-tagset
perl-http-cookiejar
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-io-html
perl-libwww
perl-lwp-mediatypes
perl-mailtools
perl-net-http
perl-timedate
perl-try-tiny
perl-uri
perl-www-robotrules
perl-xml-parser
perl-xml-writer
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pixman
pkcs11-helper
pkgconf
pkgfile
plasma-activities
playerctl
plocate
polkit
polkit-gnome
poppler
poppler-glib
poppler-qt6
popt
portaudio
power-profiles-daemon
ppp
pps-tools
procps-ng
psmisc
pugixml
pv
python
python-annotated-types
python-cairo
python-capng
python-colorama
python-contourpy
python-cycler
python-dateutil
python-dbus
python-defusedxml
python-fonttools
python-gobject
python-jinja
python-kiwisolver
python-markupsafe
python-matplotlib
python-numpy
python-orjson
python-packaging
python-pillow
python-psutil
python-pyaml
python-pydantic
python-pydantic-core
python-pyparsing
python-pyqt6
python-pyqt6-sip
python-shtab
python-six
python-termcolor
python-typing_extensions
python-typing-inspection
python-yaml
qca-qt6
qhull
qrencode
qt6-5compat
qt6-base
qt6-declarative
qt6-multimedia
qt6-multimedia-ffmpeg
qt6-shadertools
qt6-speech
qt6-svg
qt6-translations
raptor
rav1e
re2
readline
rebuild-detector
reflector
reflector-simple
ripgrep
ripgrep-all
rpcbind
rsync
rtkit
rtmpdump
rubberband
sbc
sd
sdbus-cpp
sddm
sdl2-compat
sdl3
seatd
sed
serd
sg3_utils
shaderc
shadow
shared-mime-info
slang
slurp
smartmontools
smbclient
s-nail
snappy
sndio
sof-firmware
solid
sonnet
sord
sound-theme-freedesktop
soundtouch
spandsp
spdlog
speex
speexdsp
spirv-tools
spotify
sqlite
sratom
srt
startup-notification
steam
stoken
sudo
svt-av1
svt-hevc
syndication
syntax-highlighting
sysfsutils
systemd
systemd-libs
systemd-resolvconf
systemd-sysvcompat
taglib
talloc
tar
tcl
tdb
tevent
texinfo
thin-provisioning-tools
thunar
thunar-archive-plugin
tinysparql
tldr
tomlplusplus
tpm2-tss
tslib
ttf-bitstream-vera
ttf-dejavu
ttf-jetbrains-mono-nerd
ttf-liberation
ttf-opensans
tzdata
udisks2
unrar
unzip
upower
usb_modeswitch
usbutils
util-linux
util-linux-libs
v4l-utils
vapoursynth
vi
vid.stab
viewnior
vmaf
volume_key
vpnc
vulkan-icd-loader
vulkan-tools
waybar
wayland
wayland-protocols
webkit2gtk-4.1
webrtc-audio-processing-1
welcome
wev
wget
which
wildmidi
wireplumber
wl-clipboard
woff2
wofi
wpa_supplicant
x264
x265
xbitmaps
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-dbus-proxy
xdg-desktop-portal
xdg-desktop-portal-hyprland
xdg-user-dirs
xdg-utils
xf86-input-libinput
xf86-video-amdgpu
xf86-video-ati
xfconf
xfsprogs
xkeyboard-config
xl2tpd
xmlsec
xorg-fonts-encodings
xorgproto
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xdpyinfo
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkill
xorg-xmodmap
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xwayland
xterm
xvidcore
xxhash
xz
yad
yay
zbar
zenity
zeromq
zimg
zix
zlib
zlib-ng
zstd
zvbi
zxing-cpp
