1password
accountsservice
alacritty
alsa-firmware
alsa-plugins
alsa-utils
amd-ucode
aspell
aurorae
b43-fwcutter
base
base-devel
bash-completion
bind
bluedevil
blueman
bluez
bluez-utils
breeze
breeze-gtk
breeze-plymouth
btrfs-progs
cantarell-fonts
cliphist
cpupower
cryptsetup
device-mapper
diffutils
discord
discover
dmidecode
dmraid
dnsmasq
dolphin
dosfstools
downgrade
dracut
drkonqi
duf
e2fsprogs
efibootmgr
efitools
endeavouros-branding
endeavouros-keyring
endeavouros-mirrorlist
eos-apps-info
eos-dracut
eos-hooks
eos-log-tool
eos-packagelist
eos-quickstart
eos-rankmirrors
ethtool
exfatprogs
f2fs-tools
ffmpegthumbnailer
file-roller
firefox
firewalld
flatpak-kcm
foot
gamemode
gamescope
git
glances
google-chrome
grim
grub
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-ugly
haveged
hdparm
htop
hwdetect
hwinfo
hyprland
hyprpaper
inetutils
inxi
iotop
iptables-nft
iwd
jfsutils
kactivitymanagerd
kde-cli-tools
kdecoration
kde-gtk-config
kdeplasma-addons
kgamma
kglobalacceld
kinfocenter
kmenuedit
knighttime
kpipewire
krdp
kscreen
kscreenlocker
ksshaskpass
ksystemstats
kwallet-pam
kwayland
kwin
kwin-x11
kwrited
layer-shell-qt
less
libdvdcss
libgsf
libkscreen
libksysguard
libopenraw
libplasma
libva-nvidia-driver
libwnck3
linux
linux-firmware
linux-headers
logrotate
lsb-release
lsscsi
lvm2
mako
man-db
mangohud
man-pages
mdadm
meld
mesa-utils
milou
mkinitcpio
modemmanager
mtools
nano
nano-syntax-highlighting
netctl
networkmanager
network-manager-applet
networkmanager-openconnect
networkmanager-openvpn
nfs-utils
nilfs-utils
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
nss-mdns
ntfs-3g
ntp
nvidia-hook
nvidia-inst
nvidia-open
nvtop
ocean-sound-theme
openssh
os-prober
oxygen
oxygen-sounds
pacman-contrib
pavucontrol
perl
pipewire-alsa
pipewire-jack
pipewire-pulse
pkgfile
plasma5support
plasma-activities-stats
plasma-browser-integration
plasma-desktop
plasma-disks
plasma-firewall
plasma-integration
plasma-nm
plasma-pa
plasma-sdk
plasma-systemmonitor
plasma-thunderbolt
plasma-vault
plasma-welcome
plasma-workspace
plasma-workspace-wallpapers
plocate
plymouth-kcm
polkit-gnome
polkit-kde-agent
poppler-glib
powerdevil
power-profiles-daemon
print-manager
pv
python
python-defusedxml
python-jinja
python-packaging
python-pyqt6
qqc2-breeze-style
rebuild-detector
reflector
reflector-simple
rsync
rtkit
sddm
sddm-kcm
sg3_utils
slurp
smartmontools
s-nail
sof-firmware
spectacle
spotify
steam
sudo
sysfsutils
systemd-sysvcompat
systemsettings
texinfo
thunar
thunar-archive-plugin
tldr
ttf-bitstream-vera
ttf-dejavu
ttf-jetbrains-mono-nerd
ttf-liberation
ttf-opensans
unrar
unzip
upower
usb_modeswitch
usbutils
vi
viewnior
visual-studio-code-bin
vulkan-tools
wacomtablet
waybar
welcome
wev
wget
which
wireplumber
wl-clipboard
wofi
wpa_supplicant
xdg-desktop-portal-hyprland
xdg-desktop-portal-kde
xdg-user-dirs
xdg-utils
xf86-input-libinput
xf86-video-amdgpu
xf86-video-ati
xfsprogs
xl2tpd
xorg-server
xorg-xdpyinfo
xorg-xinit
xorg-xinput
xorg-xkill
xorg-xrandr
xterm
yay
